{"config": [{"config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 16, 32, 1], "output_shape": null, "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>F\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 4, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "b_constraint": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [4, 4], "strides": [4, 4], "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 16, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "input_dim": 80, "bias": true, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}