{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "trainable": true, "batch_input_shape": [null, 16, 32, 1], "output_shape": null, "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "nb_filter": 4, "name": "convolution2d_1", "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "activation": "linear", "border_mode": "valid", "nb_filter": 16, "name": "convolution2d_2", "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_row": 3, "nb_col": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 80, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "name": "dense_1"}}]}